def @main(%data: Tensor[(1, 28, 28, 3), int8], %weight: Tensor[(3, 3, 3, 32), int8]) -> Tensor[(1, 26, 26, 32), int8] {
  accel.vit.conv2d(%data, %weight, widths=[8, 8, 8], scales=[6, 6, 5], activate=0) /* ty=Tensor[(1, 26, 26, 32), int8] */
}

def main(data, weight, tin=64, tout=32) {
  data = input() /* (1, 28, 28, 3) */
  weight = input() /* (3, 3, 3, 32) */
  %0 = accel_conv2d(data, weight) /* (1, 26, 26, 32) */
}

**************** DIFFERENCE ****************
* JOB NAME : check_conv2d
* T-F DIFF : 0
* F-T DIFF : 1
* NUM DIFF : 76
* NUM SAME : 21556
* SAME%    : 99.65%
**************** DIFFERENCE ****************

def @main(%data: Tensor[(1, 1, 64, 64), int8], %weight: Tensor[(1, 1, 64, 32), int8]) -> Tensor[(1, 1, 64, 32), int8] {
  accel.vit.mm(%data, %weight, kernel_size=[1, 1], widths=[8, 8, 8], scales=[6, 6, 4], activate=0) /* ty=Tensor[(1, 1, 64, 32), int8] */
}

def main(data, weight, tin=64, tout=32) {
  data = input() /* (1, 1, 64, 64) */
  weight = input() /* (1, 1, 64, 32) */
  %0 = accel_mm(data, weight) /* (1, 1, 64, 32) */
}

**************** DIFFERENCE ****************
* JOB NAME : check_mm
* T-F DIFF : 0
* F-T DIFF : 1
* NUM DIFF : 1
* NUM SAME : 2047
* SAME%    : 99.95%
**************** DIFFERENCE ****************

def @main(%data: Tensor[(1, 1, 64, 64), int8]) -> Tensor[(1, 1, 64, 64), int8] {
  accel.vit.softmax(%data, kernel_size=[1, 1], widths=[8, 8], scales=[6, 11], activate=0) /* ty=Tensor[(1, 1, 64, 64), int8] */
}

def main(data, tin=64, tout=32) {
  data = input() /* (1, 1, 64, 64) */
  %0 = accel_softmax(data) /* (1, 1, 64, 64) */
}

**************** DIFFERENCE ****************
* JOB NAME  : check_softmax
* OUT SCALE : 11
* T-F DIFFS : 1.0, 0.00048828125
* F-T DIFFS : 10.0, 0.0048828125
* F-T MEANS : 2.301025390625, 0.0011235475540161133
* F-T STD   : 1.6983042218118831, 0.0008292501083065836
* NUM DIFF  : 131
* NUM SAME  : 3965
* THRESHOLD : 5
* SAME%     : 96.80%
**************** DIFFERENCE ****************

def @main(%data: Tensor[(1, 1, 128, 64), int8]) -> Tensor[(1, 1, 64, 128), int8] {
  accel.vit.transpose(%data, kernel_size=[1, 1], widths=[8, 8], scales=[6, 6], activate=0) /* ty=Tensor[(1, 1, 64, 128), int8] */
}

def main(data, tin=64, tout=32) {
  data = input() /* (1, 1, 128, 64) */
  %0 = accel_transpose(data) /* (1, 1, 64, 128) */
}

**************** DIFFERENCE ****************
* JOB NAME : check_transpose
* T-F DIFF : 0
* F-T DIFF : 0
* NUM DIFF : 0
* NUM SAME : 8192
* SAME%    : 100.00%
**************** DIFFERENCE ****************

def @main(%data: Tensor[(1, 1, 128, 64), int8], %k_factor: Tensor[(64), int8], %bias: Tensor[(64), int8]) -> Tensor[(1, 1, 128, 64), int8] {
  accel.vit.layer_norm(%data, %k_factor, %bias, kernel_size=[1, 1], widths=[8, 8, 8, 8], scales=[6, 6, 6, 5], activate=0) /* ty=Tensor[(1, 1, 128, 64), int8] */
}

def main(data, k_factor, bias, tin=64, tout=32) {
  data = input() /* (1, 1, 128, 64) */
  k_factor = input() /* (64) */
  bias = input() /* (64) */
  %0 = accel_layer_norm(data, k_factor, bias) /* (1, 1, 128, 64) */
}

**************** DIFFERENCE ****************
* JOB NAME  : check_layernorm
* OUT SCALE : 5
* T-F DIFFS : 1, 0.03125
* F-T DIFFS : 2, 0.0625
* F-T MEANS : 0.2650146484375, 0.008281707763671875
* F-T STD   : 0.46478179711134154, 0.014524431159729423
* NUM DIFF  : 4
* NUM SAME  : 8188
* THRESHOLD : 1
* SAME%     : 99.95%
**************** DIFFERENCE ****************

def @main(%data: Tensor[(1, 7, 7, 64), int8], %weight: Tensor[(3, 3, 64, 32), int8], %res: Tensor[(1, 7, 7, 32), int8]) -> Tensor[(1, 7, 7, 32), int8] {
  accel.vit.conv2d_add(%data, %weight, %res, padding=[1, 1], widths=[8, 8, 8, 8], scales=[6, 6, 6, 3], activate=0) /* ty=Tensor[(1, 7, 7, 32), int8] */
}

def main(data, weight, res, tin=64, tout=32) {
  data = input() /* (1, 7, 7, 64) */
  weight = input() /* (3, 3, 64, 32) */
  res = input() /* (1, 7, 7, 32) */
  %0 = accel_conv2d_add(data, weight, res) /* (1, 7, 7, 32) */
}

**************** DIFFERENCE ****************
* JOB NAME  : check_conv2d_add
* OUT SCALE : 3
* T-F DIFFS : 7, 0.875
* F-T DIFFS : 7, 0.875
* F-T MEANS : 0.05994897959183673, 0.0074936224489795915
* F-T STD   : 0.5859563937325896, 0.0732445492165737
* NUM DIFF  : 3
* NUM SAME  : 1565
* THRESHOLD : 1
* SAME%     : 99.81%
**************** DIFFERENCE ****************

